cfe/InformationRegisters/ВИЛС_ДанныеУсловийТрудаПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ВИЛС_ДанныеУсловийТрудаПоСотрудникам</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловияТруда</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe/CommonModules/УчетРабочегоВремениРасширенный/Ext/Module.bsl
&Вместо("ЗапросВТДанныеРегистровУчетаВремени")
Функция ВИЛС_ЗапросВТДанныеРегистровУчетаВремени(ПараметрыФормированияДанных, ПараметрыПостроения)
	ЗапросРезультат = Новый Запрос;
	
	ЗапросВТПериодыДейсвияОбщихГрафиковСотрудников = ЗапросВТПериодыДейсвияОбщихГрафиковСотрудников(ПараметрыФормированияДанных);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(ЗапросРезультат, ЗапросВТПериодыДейсвияОбщихГрафиковСотрудников);
	
	ЗапросВТДанныеОбщихГрафиков = ЗапросВТДанныеОбщихГрафиков(ПараметрыФормированияДанных);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(ЗапросРезультат, ЗапросВТДанныеОбщихГрафиков);
	
	ЗапросВТДанныеРегистровУчетаВремени = Новый Запрос;
	//begin fix Клещ А.Н. 28.06.2019 
	Организация = Справочники.Организации.НайтиПоНаименованию("ОАО ""ВИЛС""");
	
	Если ВИЛС_Служебный.ИспользуютсяОсобыеУсловияТруда(Организация) Тогда
		
		ЗапросВТДанныеРегистровУчетаВремени.Текст =
		"ВЫБРАТЬ
		|	ДанныеУчетаВремени.Сотрудник КАК Сотрудник,
		|	ДанныеУчетаВремени.Месяц КАК Месяц,
		|	ДанныеУчетаВремени.ДатаАктуальности КАК ДатаАктуальности,
		|	ДанныеУчетаВремени.ПериодРегистрации КАК ПериодРегистрации,
		|	МИНИМУМ(ДанныеУчетаВремени.План) КАК План,
		|	ДанныеУчетаВремени.ВЦеломЗаПериод КАК ВЦеломЗаПериод,
		|	ВЫБОР
		|		КОГДА &ОтноситьПереходящуюЧастьСменыКДнюНачала
		|				И ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДанныеУчетаВремени.Период, ДЕНЬ, -1)
		|		ИНАЧЕ ДанныеУчетаВремени.Период
		|	КОНЕЦ КАК Дата,
		|	ДанныеУчетаВремени.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ДанныеУчетаВремени.Территория КАК Территория,
		|	ДанныеУчетаВремени.УсловияТруда КАК УсловияТруда,
		|	ВЫБОР
		|		КОГДА ДанныеУчетаВремени.ВЦеломЗаПериод
		|			ТОГДА СУММА(ДанныеУчетаВремени.Дни)
		|		КОГДА СУММА(ДанныеУчетаВремени.Дни) > 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дни,
		|	СУММА(ДанныеУчетаВремени.Часы) КАК Часы,
		|	МАКСИМУМ(ДанныеУчетаВремени.ДниПлан) КАК ДниПлан,
		|	СУММА(ДанныеУчетаВремени.ЧасыПлан) КАК ЧасыПлан,
		|	МАКСИМУМ(ДанныеУчетаВремени.ДниНорма) КАК ДниНорма,
		|	СУММА(ДанныеУчетаВремени.ЧасыНорма) КАК ЧасыНорма,
		|	МАКСИМУМ(ДанныеУчетаВремени.Смена) КАК Смена,
		|	ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
		|	ДанныеУчетаВремени.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены
		|ПОМЕСТИТЬ ВТДанныеРегистровУчетаВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеУчетаВремени.Сотрудник КАК Сотрудник,
		|		ДанныеУчетаВремени.Месяц КАК Месяц,
		|		ДанныеУчетаВремени.ДатаАктуальности КАК ДатаАктуальности,
		|		ДанныеУчетаВремени.ПериодРегистрации КАК ПериодРегистрации,
		|		ДанныеУчетаВремени.План КАК План,
		|		ДанныеУчетаВремени.ВЦеломЗаПериод КАК ВЦеломЗаПериод,
		|		ДанныеУчетаВремени.Период КАК Период,
		|		ДанныеУчетаВремени.ВидУчетаВремени КАК ВидУчетаВремени,
		|		ДанныеУчетаВремени.Смена КАК Смена,
		|		ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
		|		ДанныеУчетаВремени.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены,
		|		ДанныеУчетаВремени.Территория КАК Территория,
		|		ВЫБОР
		|			КОГДА ДанныеУчетаВремени.УсловияТруда = ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)
		|					ИЛИ ДанныеУчетаВремени.УсловияТруда ЕСТЬ NULL
		|				ТОГДА ДанныеУсловийТруда.УсловиеТруда
		|			ИНАЧЕ ДанныеУчетаВремени.УсловияТруда
		|		КОНЕЦ КАК УсловияТруда,
		|		ДанныеУчетаВремени.Дни КАК Дни,
		|		ДанныеУчетаВремени.Часы КАК Часы,
		|		ДанныеУчетаВремени.ДниПлан КАК ДниПлан,
		|		ДанныеУчетаВремени.ЧасыПлан КАК ЧасыПлан,
		|		ДанныеУчетаВремени.ДниНорма КАК ДниНорма,
		|		ДанныеУчетаВремени.ЧасыНорма КАК ЧасыНорма
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник КАК Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц КАК Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности КАК ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации КАК ПериодРегистрации,
		|			ЛОЖЬ КАК План,
		|			ЛОЖЬ КАК ВЦеломЗаПериод,
		|			ДанныеРегистраУчетаВремени.Период КАК Период,
		|			ДанныеРегистраУчетаВремени.ВидУчетаВремени КАК ВидУчетаВремени,
		|			ДанныеРегистраУчетаВремени.Смена КАК Смена,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены,
		|			ДанныеРегистраУчетаВремени.Территория КАК Территория,
		|			ДанныеРегистраУчетаВремени.УсловияТруда КАК УсловияТруда,
		|			ДанныеРегистраУчетаВремени.Дни КАК Дни,
		|			ДанныеРегистраУчетаВремени.Часы КАК Часы,
		|			0 КАК ДниПлан,
		|			0 КАК ЧасыПлан,
		|			0 КАК ДниНорма,
		|			0 КАК ЧасыНорма
		|		ИЗ
		|			ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеТабельногоУчетаРабочегоВремениСотрудников КАК ДанныеРегистраУчетаВремени
		|				ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|					И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|					И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|						ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|					И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ДанныеТабельногоУчета))
		|					И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|					И (&УсловиеОграничениеПериода)
		|					И (&УсловиеРегистратор)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|			ЛОЖЬ,
		|			ЛОЖЬ,
		|			ДанныеРегистраУчетаВремени.Период,
		|			ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|			ДанныеРегистраУчетаВремени.Смена,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены,
		|			ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|			ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|			ДанныеРегистраУчетаВремени.Дни,
		|			ДанныеРегистраУчетаВремени.Часы,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников КАК ДанныеРегистраУчетаВремени
		|				ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|					И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|					И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|						ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|					И ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ДанныеРегистраУчетаВремени.ВидДанных
		|					И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|					И (&УсловиеОграничениеПериода)
		|					И (&УсловиеРегистратор)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|			ЛОЖЬ,
		|			ЛОЖЬ,
		|			ДанныеРегистраУчетаВремени.Период,
		|			ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|			ДанныеРегистраУчетаВремени.Смена,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены,
		|			ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|			ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|			0,
		|			-ДанныеРегистраУчетаВремени.Часы,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВытесняемоеПлановоеВремяСотрудников КАК ДанныеРегистраУчетаВремени
		|				ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|					И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|					И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|						ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|					И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ВытесняемоеПлановоеВремя))
		|					И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|					И (&УсловиеОграничениеПериода)
		|					И (&УсловиеРегистратор)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|			ЛОЖЬ,
		|			ИСТИНА,
		|			ДанныеРегистраУчетаВремени.Период,
		|			ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|			ЗНАЧЕНИЕ(Справочник.СменыРаботыСотрудников.ПустаяСсылка),
		|			ЛОЖЬ,
		|			ЛОЖЬ,
		|			ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|			ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|			СУММА(ДанныеРегистраУчетаВремени.Дни),
		|			СУММА(ДанныеРегистраУчетаВремени.Часы),
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеСводногоУчетаРабочегоВремениСотрудников КАК ДанныеРегистраУчетаВремени
		|				ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|					И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|					И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.СводныеДанные))
		|					И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|					И (&УсловиеОграничениеПериода)
		|					И (&УсловиеРегистратор)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|			ДанныеРегистраУчетаВремени.Период,
		|			ДанныеРегистраУчетаВремени.ВидУчетаВремени
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			ЛОЖЬ,
		|			ДанныеРегистраУчетаВремени.Период,
		|			ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|			ДанныеРегистраУчетаВремени.Смена,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|			ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены,
		|			ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|			ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|					ТОГДА ДанныеРегистраУчетаВремени.Дни
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|					ТОГДА ДанныеРегистраУчетаВремени.Часы
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеРегистраУчетаВремени.Дни
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеРегистраУчетаВремени.Часы
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеРегистраУчетаВремени.Дни
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеРегистраУчетаВремени.Часы
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеИндивидуальныхГрафиковСотрудников КАК ДанныеРегистраУчетаВремени
		|				ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|					И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|					И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|						ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|							И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|					И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ДанныеИндивидуальныхГрафиков))
		|					И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|					И (&УсловиеОграничениеПериода)
		|					И (&УсловиеРегистратор)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|			ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|			ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|			ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			ЛОЖЬ,
		|			ДанныеОбщихГрафиков.Дата,
		|			ДанныеОбщихГрафиков.ВидУчетаВремени,
		|			ДанныеОбщихГрафиков.Смена,
		|			ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены,
		|			ДанныеОбщихГрафиков.ПереходящаяЧастьТекущейСмены,
		|			ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|			ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|			ВЫБОР
		|				КОГДА НЕ ПериодыДейсвияОбщихГрафиковСотрудников.ТолькоПлановоеВремя
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|					ТОГДА ДанныеОбщихГрафиков.Дней
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА НЕ ПериодыДейсвияОбщихГрафиковСотрудников.ТолькоПлановоеВремя
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|					ТОГДА ДанныеОбщихГрафиков.Часов
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеОбщихГрафиков.Дней
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеОбщихГрафиков.Часов
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеОбщихГрафиков.ДнейНорма
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|					ТОГДА ДанныеОбщихГрафиков.ЧасовНорма
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыДейсвияОбщихГрафиковСотрудников КАК ПериодыДейсвияОбщихГрафиковСотрудников
		|				ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ПериодыДейсвияОбщихГрафиковСотрудников.Сотрудник
		|					И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ДанныеОбщихГрафиков))
		|					И ИсточникиПолученияДанныхУчетаВремени.Месяц = ПериодыДейсвияОбщихГрафиковСотрудников.Месяц
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеОбщихГрафиков КАК ДанныеОбщихГрафиков
		|				ПО (ПериодыДейсвияОбщихГрафиковСотрудников.ГрафикРаботы = ДанныеОбщихГрафиков.ГрафикРаботы)
		|					И (ДанныеОбщихГрафиков.Дата МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|					И (ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|							И (ДанныеОбщихГрафиков.Дата <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|						ИЛИ НЕ ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены
		|							И (ДанныеОбщихГрафиков.Дата <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|								ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|							И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|					И (ПериодыДейсвияОбщихГрафиковСотрудников.ДатаНачала <= ДанныеОбщихГрафиков.Дата)
		|					И (ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания >= ДанныеОбщихГрафиков.Дата
		|						ИЛИ ДанныеОбщихГрафиков.Дата = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания, ДЕНЬ), ДЕНЬ, 1)
		|							И ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПараметрыПолученияДанныхПоСотрудникам.Сотрудник,
		|			ПараметрыПолученияДанныхПоСотрудникам.Месяц,
		|			ПараметрыПолученияДанныхПоСотрудникам.ДатаАктуальности,
		|			ПараметрыПолученияДанныхПоСотрудникам.ПериодРегистрации,
		|			ГрафикиРаботыПоВидамВремени.План,
		|			ГрафикиРаботыПоВидамВремени.ВЦеломЗаПериод,
		|			ГрафикиРаботыПоВидамВремени.Дата,
		|			ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|			ГрафикиРаботыПоВидамВремени.Смена,
		|			ГрафикиРаботыПоВидамВремени.ПереходящаяЧастьПредыдущейСмены,
		|			ГрафикиРаботыПоВидамВремени.ПереходящаяЧастьТекущейСмены,
		|			ГрафикиРаботыПоВидамВремени.Территория,
		|			ГрафикиРаботыПоВидамВремени.УсловияТруда,
		|			ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
		|			ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
		|			0,
		|			0,
		|			ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма,
		|			ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
		|		ИЗ
		|			ВТПараметрыПолученияДанныхПоСотрудникам КАК ПараметрыПолученияДанныхПоСотрудникам
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|				ПО ПараметрыПолученияДанныхПоСотрудникам.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|					И ПараметрыПолученияДанныхПоСотрудникам.Месяц = ГрафикиРаботыПоВидамВремени.Месяц
		|					И ПараметрыПолученияДанныхПоСотрудникам.ПериодРегистрации = ГрафикиРаботыПоВидамВремени.ПериодРегистрации
		|					И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ПараметрыПолученияДанныхПоСотрудникам.ДАТАНАЧАЛА И ПараметрыПолученияДанныхПоСотрудникам.ДАТАОкончания)
		|					И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени <> &РабочееВремя)
		|					И (НЕ ГрафикиРаботыПоВидамВремени.ВремяВЧасах)
		|					И (ПараметрыПолученияДанныхПоСотрудникам.ПолучатьРассчитанныеДанныеФакт)) КАК ДанныеУчетаВремени
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Периоды.Период КАК Период,
		|				УсловияТруда.Сотрудник КАК Сотрудник,
		|				УсловияТруда.УсловиеТруда КАК УсловиеТруда
		|			ИЗ
		|				(ВЫБРАТЬ
		|					ВИЛС_ДанныеПоУсловиямТрудаПоСотрудникамСрезПоследних.Сотрудник КАК Сотрудник,
		|					ВИЛС_ДанныеПоУсловиямТрудаПоСотрудникамСрезПоследних.УсловияТруда КАК УсловиеТруда,
		|					&ДатаНачала КАК Период
		|				ИЗ
		|					РегистрСведений.ВИЛС_ДанныеУсловийТрудаПоСотрудникам.СрезПоследних(
		|							&ДатаНачала,
		|							Сотрудник В
		|								(ВЫБРАТЬ
		|									ВТПараметрыПолученияДанныхПоСотрудникам.Сотрудник
		|								ИЗ
		|									ВТПараметрыПолученияДанныхПоСотрудникам)) КАК ВИЛС_ДанныеПоУсловиямТрудаПоСотрудникамСрезПоследних
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ВИЛС_ДанныеПоУсловиямТрудаПоСотрудникамСрезПоследних.УсловияТруда,
		|					ВИЛС_ДанныеПоУсловиямТрудаПоСотрудникамСрезПоследних.Сотрудник
		|				
		|				ОБЪЕДИНИТЬ ВСЕ
		|				
		|				ВЫБРАТЬ
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.Сотрудник,
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.УсловияТруда,
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.Период
		|				ИЗ
		|					РегистрСведений.ВИЛС_ДанныеУсловийТрудаПоСотрудникам КАК ВИЛС_ДанныеУсловийТрудаПоСотрудникам
		|				ГДЕ
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					И ВИЛС_ДанныеУсловийТрудаПоСотрудникам.Сотрудник В
		|							(ВЫБРАТЬ
		|								ВТПараметрыПолученияДанныхПоСотрудникам.Сотрудник
		|							ИЗ
		|								ВТПараметрыПолученияДанныхПоСотрудникам)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.Период,
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.Сотрудник,
		|					ВИЛС_ДанныеУсловийТрудаПоСотрудникам.УсловияТруда) КАК УсловияТруда
		|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d) КАК Период
		|					ИЗ
		|						(ВЫБРАТЬ
		|							0 КАК a
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							1
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							2
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							3
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							4
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							5
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							6
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							7
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							8
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							9) КАК aa
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								0 КАК b
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								1
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								2
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								3
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								4
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								5
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								6
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								7
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								8
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								9) КАК bb
		|							ПО (ИСТИНА)
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								0 КАК c
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								1
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								2
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								3
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								4
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								5
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								6
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								7
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								8
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								9) КАК cc
		|							ПО (ИСТИНА)
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								0 КАК d
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								1
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								2
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								3
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								4
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								5
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								6
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								7
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								8
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								9) КАК dd
		|							ПО (ИСТИНА)
		|					ГДЕ
		|						aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d <= РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, ДЕНЬ)) КАК Периоды
		|					ПО (Периоды.Период >= УсловияТруда.Период)) КАК ДанныеУсловийТруда
		|			ПО ДанныеУчетаВремени.Период = ДанныеУсловийТруда.Период
		|				И ДанныеУчетаВремени.Сотрудник = ДанныеУсловийТруда.Сотрудник) КАК ДанныеУчетаВремени
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчетаВремени.Сотрудник,
		|	ДанныеУчетаВремени.Месяц,
		|	ДанныеУчетаВремени.ДатаАктуальности,
		|	ДанныеУчетаВремени.ПериодРегистрации,
		|	ДанныеУчетаВремени.ВЦеломЗаПериод,
		|	ДанныеУчетаВремени.Период,
		|	ДанныеУчетаВремени.ВидУчетаВремени,
		|	ДанныеУчетаВремени.Территория,
		|	ДанныеУчетаВремени.УсловияТруда,
		|	ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|	ДанныеУчетаВремени.ПереходящаяЧастьТекущейСмены
		|";
		
	Иначе
		
		ЗапросВТДанныеРегистровУчетаВремени.Текст = 
		"ВЫБРАТЬ
		|	ДанныеУчетаВремени.Сотрудник КАК Сотрудник,
		|	ДанныеУчетаВремени.Месяц КАК Месяц,
		|	ДанныеУчетаВремени.ДатаАктуальности КАК ДатаАктуальности,
		|	ДанныеУчетаВремени.ПериодРегистрации КАК ПериодРегистрации,
		|	МИНИМУМ(ДанныеУчетаВремени.План) КАК План,
		|	ДанныеУчетаВремени.ВЦеломЗаПериод КАК ВЦеломЗаПериод,
		|	ВЫБОР
		|		КОГДА &ОтноситьПереходящуюЧастьСменыКДнюНачала
		|				И ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДанныеУчетаВремени.Период, ДЕНЬ, -1)
		|		ИНАЧЕ ДанныеУчетаВремени.Период
		|	КОНЕЦ КАК Дата,
		|	ДанныеУчетаВремени.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ДанныеУчетаВремени.Территория КАК Территория,
		|	ДанныеУчетаВремени.УсловияТруда КАК УсловияТруда,
		|	ВЫБОР
		|		КОГДА ДанныеУчетаВремени.ВЦеломЗаПериод
		|			ТОГДА СУММА(ДанныеУчетаВремени.Дни)
		|		КОГДА СУММА(ДанныеУчетаВремени.Дни) > 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дни,
		|	СУММА(ДанныеУчетаВремени.Часы) КАК Часы,
		|	МАКСИМУМ(ДанныеУчетаВремени.ДниПлан) КАК ДниПлан,
		|	СУММА(ДанныеУчетаВремени.ЧасыПлан) КАК ЧасыПлан,
		|	МАКСИМУМ(ДанныеУчетаВремени.ДниНорма) КАК ДниНорма,
		|	СУММА(ДанныеУчетаВремени.ЧасыНорма) КАК ЧасыНорма,
		|	МАКСИМУМ(ДанныеУчетаВремени.Смена) КАК Смена,
		|	ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
		|	ДанныеУчетаВремени.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены
		|ПОМЕСТИТЬ ВТДанныеРегистровУчетаВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник КАК Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц КАК Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности КАК ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации КАК ПериодРегистрации,
		|		ЛОЖЬ КАК План,
		|		ЛОЖЬ КАК ВЦеломЗаПериод,
		|		ДанныеРегистраУчетаВремени.Период КАК Период,
		|		ДанныеРегистраУчетаВремени.ВидУчетаВремени КАК ВидУчетаВремени,
		|		ДанныеРегистраУчетаВремени.Смена КАК Смена,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены,
		|		ДанныеРегистраУчетаВремени.Территория КАК Территория,
		|		ДанныеРегистраУчетаВремени.УсловияТруда КАК УсловияТруда,
		|		ДанныеРегистраУчетаВремени.Дни КАК Дни,
		|		ДанныеРегистраУчетаВремени.Часы КАК Часы,
		|		0 КАК ДниПлан,
		|		0 КАК ЧасыПлан,
		|		0 КАК ДниНорма,
		|		0 КАК ЧасыНорма
		|	ИЗ
		|		ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеТабельногоУчетаРабочегоВремениСотрудников КАК ДанныеРегистраУчетаВремени
		|			ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|				И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|				И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|					ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|				И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ДанныеТабельногоУчета))
		|				И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|				И (&УсловиеОграничениеПериода)
		|				И (&УсловиеРегистратор)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ДанныеРегистраУчетаВремени.Период,
		|		ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|		ДанныеРегистраУчетаВремени.Смена,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены,
		|		ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|		ДанныеРегистраУчетаВремени.Дни,
		|		ДанныеРегистраУчетаВремени.Часы,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников КАК ДанныеРегистраУчетаВремени
		|			ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|				И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|				И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|					ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|				И ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ДанныеРегистраУчетаВремени.ВидДанных
		|				И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|				И (&УсловиеОграничениеПериода)
		|				И (&УсловиеРегистратор)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ДанныеРегистраУчетаВремени.Период,
		|		ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|		ДанныеРегистраУчетаВремени.Смена,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены,
		|		ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|		0,
		|		-ДанныеРегистраУчетаВремени.Часы,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВытесняемоеПлановоеВремяСотрудников КАК ДанныеРегистраУчетаВремени
		|			ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|				И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|				И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|					ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|				И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ВытесняемоеПлановоеВремя))
		|				И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|				И (&УсловиеОграничениеПериода)
		|				И (&УсловиеРегистратор)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|		ЛОЖЬ,
		|		ИСТИНА,
		|		ДанныеРегистраУчетаВремени.Период,
		|		ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|		ЗНАЧЕНИЕ(Справочник.СменыРаботыСотрудников.ПустаяСсылка),
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|		СУММА(ДанныеРегистраУчетаВремени.Дни),
		|		СУММА(ДанныеРегистраУчетаВремени.Часы),
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеСводногоУчетаРабочегоВремениСотрудников КАК ДанныеРегистраУчетаВремени
		|			ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|				И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|				И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.СводныеДанные))
		|				И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|				И (&УсловиеОграничениеПериода)
		|				И (&УсловиеРегистратор)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|		ДанныеРегистраУчетаВремени.Период,
		|		ДанныеРегистраУчетаВремени.ВидУчетаВремени
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ,
		|		ЛОЖЬ,
		|		ДанныеРегистраУчетаВремени.Период,
		|		ДанныеРегистраУчетаВремени.ВидУчетаВремени,
		|		ДанныеРегистраУчетаВремени.Смена,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|		ДанныеРегистраУчетаВремени.ПереходящаяЧастьТекущейСмены,
		|		ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|				ТОГДА ДанныеРегистраУчетаВремени.Дни
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|				ТОГДА ДанныеРегистраУчетаВремени.Часы
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеРегистраУчетаВремени.Дни
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеРегистраУчетаВремени.Часы
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеРегистраУчетаВремени.Дни
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеРегистраУчетаВремени.Часы
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеИндивидуальныхГрафиковСотрудников КАК ДанныеРегистраУчетаВремени
		|			ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ДанныеРегистраУчетаВремени.Сотрудник
		|				И (ДанныеРегистраУчетаВремени.Период МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|				И (ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|					ИЛИ НЕ ДанныеРегистраУчетаВремени.ПереходящаяЧастьПредыдущейСмены
		|						И (ДанныеРегистраУчетаВремени.Период <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|				И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ДанныеИндивидуальныхГрафиков))
		|				И ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности >= ДанныеРегистраУчетаВремени.ПериодРегистрации
		|				И (&УсловиеОграничениеПериода)
		|				И (&УсловиеРегистратор)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсточникиПолученияДанныхУчетаВремени.Сотрудник,
		|		ИсточникиПолученияДанныхУчетаВремени.Месяц,
		|		ИсточникиПолученияДанныхУчетаВремени.ДатаАктуальности,
		|		ИсточникиПолученияДанныхУчетаВремени.ПериодРегистрации,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ,
		|		ЛОЖЬ,
		|		ДанныеОбщихГрафиков.Дата,
		|		ДанныеОбщихГрафиков.ВидУчетаВремени,
		|		ДанныеОбщихГрафиков.Смена,
		|		ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены,
		|		ДанныеОбщихГрафиков.ПереходящаяЧастьТекущейСмены,
		|		ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка),
		|		ВЫБОР
		|			КОГДА НЕ ПериодыДейсвияОбщихГрафиковСотрудников.ТолькоПлановоеВремя
		|					И ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|				ТОГДА ДанныеОбщихГрафиков.Дней
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА НЕ ПериодыДейсвияОбщихГрафиковСотрудников.ТолькоПлановоеВремя
		|					И ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеФакт
		|				ТОГДА ДанныеОбщихГрафиков.Часов
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеОбщихГрафиков.Дней
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеОбщихГрафиков.Часов
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеОбщихГрафиков.ДнейНорма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ИсточникиПолученияДанныхУчетаВремени.ПолучатьДанныеПлан
		|				ТОГДА ДанныеОбщихГрафиков.ЧасовНорма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		ВТИсточникиПолученияДанныхУчетаВремени КАК ИсточникиПолученияДанныхУчетаВремени
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыДейсвияОбщихГрафиковСотрудников КАК ПериодыДейсвияОбщихГрафиковСотрудников
		|			ПО ИсточникиПолученияДанныхУчетаВремени.Сотрудник = ПериодыДейсвияОбщихГрафиковСотрудников.Сотрудник
		|				И (ИсточникиПолученияДанныхУчетаВремени.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхУчетаВремениСотрудников.ДанныеОбщихГрафиков))
		|				И ИсточникиПолученияДанныхУчетаВремени.Месяц = ПериодыДейсвияОбщихГрафиковСотрудников.Месяц
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеОбщихГрафиков КАК ДанныеОбщихГрафиков
		|			ПО (ПериодыДейсвияОбщихГрафиковСотрудников.ГрафикРаботы = ДанныеОбщихГрафиков.ГрафикРаботы)
		|				И (ДанныеОбщихГрафиков.Дата МЕЖДУ ИсточникиПолученияДанныхУчетаВремени.ДатаНачала И ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания)
		|				И (ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСмены
		|						И (ДанныеОбщихГрафиков.Дата <> ИсточникиПолученияДанныхУчетаВремени.ДатаНачала
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьПереходящуюЧастьСменыНаНачалоПериода)
		|					ИЛИ НЕ ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены
		|						И (ДанныеОбщихГрафиков.Дата <> ИсточникиПолученияДанныхУчетаВремени.ДатаОкончания
		|							ИЛИ ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСменыНаКонецПериода)
		|						И ИсточникиПолученияДанныхУчетаВремени.ПолучатьОсновнуюЧастьСмены)
		|				И (ПериодыДейсвияОбщихГрафиковСотрудников.ДатаНачала <= ДанныеОбщихГрафиков.Дата)
		|				И (ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания >= ДанныеОбщихГрафиков.Дата
		|					ИЛИ ДанныеОбщихГрафиков.Дата = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания, ДЕНЬ), ДЕНЬ, 1)
		|						И ДанныеОбщихГрафиков.ПереходящаяЧастьПредыдущейСмены)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПараметрыПолученияДанныхПоСотрудникам.Сотрудник,
		|		ПараметрыПолученияДанныхПоСотрудникам.Месяц,
		|		ПараметрыПолученияДанныхПоСотрудникам.ДатаАктуальности,
		|		ПараметрыПолученияДанныхПоСотрудникам.ПериодРегистрации,
		|		ГрафикиРаботыПоВидамВремени.План,
		|		ГрафикиРаботыПоВидамВремени.ВЦеломЗаПериод,
		|		ГрафикиРаботыПоВидамВремени.Дата,
		|		ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|		ГрафикиРаботыПоВидамВремени.Смена,
		|		ГрафикиРаботыПоВидамВремени.ПереходящаяЧастьПредыдущейСмены,
		|		ГрафикиРаботыПоВидамВремени.ПереходящаяЧастьТекущейСмены,
		|		ГрафикиРаботыПоВидамВремени.Территория,
		|		ГрафикиРаботыПоВидамВремени.УсловияТруда,
		|		ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
		|		ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
		|		0,
		|		0,
		|		ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма,
		|		ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
		|	ИЗ
		|		ВТПараметрыПолученияДанныхПоСотрудникам КАК ПараметрыПолученияДанныхПоСотрудникам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|			ПО ПараметрыПолученияДанныхПоСотрудникам.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|				И ПараметрыПолученияДанныхПоСотрудникам.Месяц = ГрафикиРаботыПоВидамВремени.Месяц
		|				И ПараметрыПолученияДанныхПоСотрудникам.ПериодРегистрации = ГрафикиРаботыПоВидамВремени.ПериодРегистрации
		|				И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ПараметрыПолученияДанныхПоСотрудникам.ДатаНачала И ПараметрыПолученияДанныхПоСотрудникам.ДатаОкончания)
		|				И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени <> &РабочееВремя)
		|				И (НЕ ГрафикиРаботыПоВидамВремени.ВремяВЧасах)
		|				И (ПараметрыПолученияДанныхПоСотрудникам.ПолучатьРассчитанныеДанныеФакт)) КАК ДанныеУчетаВремени
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчетаВремени.Сотрудник,
		|	ДанныеУчетаВремени.Месяц,
		|	ДанныеУчетаВремени.ДатаАктуальности,
		|	ДанныеУчетаВремени.ПериодРегистрации,
		|	ДанныеУчетаВремени.ВЦеломЗаПериод,
		|	ДанныеУчетаВремени.Период,
		|	ДанныеУчетаВремени.ВидУчетаВремени,
		|	ДанныеУчетаВремени.Территория,
		|	ДанныеУчетаВремени.УсловияТруда,
		|	ДанныеУчетаВремени.ПереходящаяЧастьПредыдущейСмены,
		|	ДанныеУчетаВремени.ПереходящаяЧастьТекущейСмены";
		// удалим лишние запросы
	КонецЕсли;
	//end fix Клещ А.Н. 28.06.2019
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ЗапросВТДанныеРегистровУчетаВремени.Текст);	
	ЗапросПолученияДанных = СхемаЗапроса.ПакетЗапросов[0];
	
	Если Не ПараметрыФормированияДанных.ПолучатьДанныеФакт Тогда
		ЗапросПолученияДанных.Операторы[0].Источники[0].Источник.Запрос.Операторы.Удалить(6);
		ЗапросПолученияДанных.Операторы[0].Источники[0].Источник.Запрос.Операторы.Удалить(3);
		ЗапросПолученияДанных.Операторы[0].Источники[0].Источник.Запрос.Операторы.Удалить(2);
		ЗапросПолученияДанных.Операторы[0].Источники[0].Источник.Запрос.Операторы.Удалить(1);
		ЗапросПолученияДанных.Операторы[0].Источники[0].Источник.Запрос.Операторы.Удалить(0);		
	КонецЕсли;
	
	ЗапросВТДанныеРегистровУчетаВремени.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();		
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(ЗапросРезультат, ЗапросВТДанныеРегистровУчетаВремени);
	
	УстановитьУсловиеНеучитываемыеРегистраторы(ЗапросРезультат, ПараметрыФормированияДанных, "ДанныеРегистраУчетаВремени.Регистратор");
	УстановитьУсловиеОграниченияПериода(ЗапросРезультат, ПараметрыФормированияДанных, "ДанныеРегистраУчетаВремени.Период");
	УстановитьПараметрВЗапросПолученияДанныхУчетаВремени(ЗапросРезультат, "ОтноситьПереходящуюЧастьСменыКДнюНачала", ПараметрыФормированияДанных.ОтноситьПереходящуюЧастьСменыКДнюНачала);
	
	Если Не ПараметрыФормированияДанных.ПолучатьУсловияТрудаИТерритории Тогда
		ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ДанныеРегистраУчетаВремени.Территория", "ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)");		
		ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ГрафикиРаботыПоВидамВремени.Территория", "ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)");
		
		ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ДанныеРегистраУчетаВремени.УсловияТруда", "ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)");		
		ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ГрафикиРаботыПоВидамВремени.УсловияТруда", "ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)");
	ИначеЕсли Не ПараметрыФормированияДанных.УчитыватьТабльныеДанныеОТерриториях Тогда
		ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ДанныеРегистраУчетаВремени.Территория", "ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)");		
		ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ГрафикиРаботыПоВидамВремени.Территория", "ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)");	
	КонецЕсли;	
	
	ЗапросРезультат.Текст = СтрЗаменить(ЗапросРезультат.Текст, "ВТДанныеРегистровУчетаВремени", ПараметрыПостроения.ИмяВТРезультат);
	
	ЗапросРезультат.УстановитьПараметр("РабочееВремя", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя"));
	
	Возврат ЗапросРезультат;	
КонецФункции

&Вместо("СоздатьВТДанныеУчетаРабочегоВремениСотрудников")
// Помещает в менеджер временных таблиц временную таблицу ВТДанныеУчетаРабочегоВремениСотрудников с данными учета
// времени сотрудников.
//	
// Параметры:
//  МенеджерВременныхТаблиц  - МенеджерВременныхТаблиц - обязательно содержащий в себе таблицы:
//     * ВТСотрудники (имя временной таблицы определяется в параметре ПараметрыПолученияДанныхОВремени) - временная
//     таблица - обязательно содержит поля.
//        ** Сотрудник         - СправочникСсылка.Сотрудники - сотрудник, по которому нужно получить данные.
//        ** Месяц 	           - Дата - месяц, за который нужно получить данные.
//        ** ДатаАктуальности  - Дата - Будут учитываться только те данные о времени, 
//										которые зарегистрированы не позже переданного значения.
//        ** ДатаНачала 	   - Дата - ограничивает период получения данных внутри месяца.
//        ** ДатаОкончания 	   - Дата - ограничивает период получения данных внутри месяца.
//  ТолькоРазрешенные - Булево - определяет, будет ли производится попытка получить данные, на которые у пользователя
//                               нет прав.
//								 Используется когда данные необходимо получать целостно.
//  ПараметрыПолученияДанныхОВремени - Структура - структура с полями (см. функцию
//                                                 ПараметрыДляСоздатьВТДанныеУчетаРабочегоВремениСотрудников).
//
// Результат выполнения - 
//	Помещает в МенеджерВременныхТаблиц таблицу ВТДанныеУчетаРабочегоВремениСотрудников с полями.
//     * Сотрудник         - СправочникСсылка.Сотрудники - сотрудник.
//     * Дата      		   - Дата - дата за которую получены данные.
//     * ВЦеломЗаПериод    - Булево - признак того, что данные были зарегистрированы сводно.
//     * Дней              - Число - в случае сводной регистрации времени может быть меньше 1.
//     * Часов			   - Число - количество часов по виду времени за день.
//     * ВидУчетаВремени   - СправочникСсылка.ВидыИспользованияРабочегоВремени - вид использования рабочего времени.
//     * ОсновноеВремя     - СправочникСсылка.ВидыИспользованияРабочегоВремени - основное время, один из
//                                                                               предопределенных в системе видов
//                                                                               времени.
//     * НормаЧасов        - Число - норма часов по всем видам времени за день.
//     * ПериодРегистрации - Дата  - период в котором были зарегистрированы данные о времени.
//     * ЧасовПлан		   - Число - плановое количество часов.
//     * ДнейПлан		   - Число - плановое количество дней, в случае сводной регистрации планового времени, может быть
//                              меньше 1.
//
Процедура ВИЛС_СоздатьВТДанныеУчетаРабочегоВремениСотрудников(МенеджерВременныхТаблиц, ТолькоРазрешенные, ПараметрыПолученияДанныхОВремени) Экспорт
	ПараметрыПолученияДанныхОВремениСлужебный = ПараметрыПолученияДанныхУчетаВремени();
	
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияДанныхОВремениСлужебный, ПараметрыПолученияДанныхОВремени);
	
	Запрос = ЗапросВТДанныеУчетаРабочегоВремениСотрудников(ТолькоРазрешенные, ПараметрыПолученияДанныхОВремениСлужебный);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	//begin fix Клещ А.Н. 28.06.2019
	Организация = Справочники.Организации.НайтиПоНаименованию("ОАО ""ВИЛС""");
	Если ВИЛС_Служебный.ИспользуютсяОсобыеУсловияТруда(Организация) Тогда
		ЗапросВТ = Новый Запрос;
		ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросВТ.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ВТСотрудники.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ВТСотрудники.ДатаОкончания) КАК ДатаОкончания
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники";
		Выборка = ЗапросВТ.Выполнить().Выбрать();
		
		Выборка.Следующий();
		
		Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Выборка.ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Выборка.ДатаОкончания));
	КонецЕсли;
	//end fix Клещ А.Н. 28.06.2019
	
	Запрос.Выполнить();
КонецПроцедуры
